In [22]:
import pandas as pd
import re

In [23]:
import matplotlib.pyplot as plt

In [24]:
%matplotlib inline

In [25]:
summary = pd.read_csv("atusdata/atussum_2013.dat")
summary.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11385 entries, 0 to 11384
Columns: 413 entries, tucaseid to t500107
dtypes: float64(1), int64(412)
memory usage: 36.0 MB

In [26]:
summary.columns

Index(['tucaseid', 'TUFINLWGT', 'TRYHHCHILD', 'TEAGE', 'TESEX', 'PEEDUCA',
       'PTDTRACE', 'PEHSPNON', 'GTMETSTA', 'TELFS',
       ...
       't181501', 't181599', 't181601', 't181801', 't189999', 't500101',
       't500103', 't500105', 't500106', 't500107'],
      dtype='object', length=413)

In [35]:
men = summary.TESEX == 1
women = summary.TESEX == 2

In [36]:
male_data = summary[men]
female_data = summary[women]

In [38]:
male_data.head()

,tucaseid,TUFINLWGT,TRYHHCHILD,TEAGE,TESEX,PEEDUCA,PTDTRACE,PEHSPNON,GTMETSTA,TELFS,...,t181501,t181599,t181601,t181801,t189999,t500101,t500103,t500105,t500106,t500107
1,20130101130112,4447638.009513,1,39,1,43,1,2,1,1,...,0,0,0,0,0,0,0,0,0,0
6,20130101130658,5671341.270490,-1,72,1,42,1,1,1,5,...,0,0,5,0,0,0,0,0,0,0
11,20130101130768,6755514.216327,1,31,1,43,4,2,1,1,...,0,0,0,0,0,0,0,0,0,0
12,20130101130799,13506297.294756,-1,52,1,39,1,2,2,1,...,0,0,0,0,0,0,0,0,0,0
14,20130101130839,11791654.393174,-1,66,1,44,1,2,2,5,...,0,0,0,0,0,0,0,0,0,0

In [39]:
female_data.head()

,tucaseid,TUFINLWGT,TRYHHCHILD,TEAGE,TESEX,PEEDUCA,PTDTRACE,PEHSPNON,GTMETSTA,TELFS,...,t181501,t181599,t181601,t181801,t189999,t500101,t500103,t500105,t500106,t500107
0,20130101130004,11899905.662034,12,22,2,40,8,2,1,5,...,0,0,0,0,0,0,0,0,0,0
2,20130101130123,10377056.507734,-1,47,2,40,1,2,1,4,...,25,0,0,0,0,0,0,0,0,0
3,20130101130611,7731257.992805,-1,50,2,40,1,1,1,1,...,0,0,0,0,0,0,0,0,0,0
4,20130101130616,4725269.227067,-1,45,2,40,2,2,1,1,...,0,0,0,0,0,0,0,0,0,0
5,20130101130619,2372791.046351,-1,80,2,38,1,2,1,5,...,0,0,0,0,0,0,0,0,0,0

In [42]:
male_cleaning_data = male_data[['TUFINLWGT', 't020101', 't020102', 't020103', 't020104', 
                                't020199']]
male_cleaning_data = male_cleaning_data.rename(columns={"TUFINLWGT": "weight", 't020101': "Cleaning", 't020102': "Laundry",
                            't020103': 'Sewing', 't020104': 'Storing', 't020199': 'Other'})
male_cleaning_data.head()

             weight  Cleaning  Laundry  Sewing  Storing  Other
1    4447638.009513        25        0       0        0      0
6    5671341.270490         0        0       0       20      0
11   6755514.216327        40       10       0        0      0
12  13506297.294756         0      210       0        0      0
14  11791654.393174         0        0       0        0      0

In [43]:
female_cleaning_data = female_data[['TUFINLWGT', 't020101', 't020102', 't020103', 't020104', 
                                't020199']]
female_cleaning_data = female_cleaning_data.rename(columns={"TUFINLWGT": "weight", 't020101': "Cleaning", 't020102': "Laundry",
                            't020103': 'Sewing', 't020104': 'Storing', 't020199': 'Other'})
female_cleaning_data.head()

            weight  Cleaning  Laundry  Sewing  Storing  Other
0  11899905.662034         0        0       0        0      0
2  10377056.507734         0        0       0        0      0
3   7731257.992805         0        0       0        0      0
4   4725269.227067         0       30       0        0      0
5   2372791.046351        90        0       0        0      0

In [45]:
female_cleaning_data['total_cleaning_minutes'] = female_cleaning_data.Cleaning + \
                                                 female_cleaning_data.Laundry + \
                                                 female_cleaning_data.Sewing + \
                                                 female_cleaning_data.Storing + \
                                                 female_cleaning_data.Other

In [46]:
female_cleaning_data.head()

,weight,Cleaning,Laundry,Sewing,Storing,Other,total_cleaning_minutes
0,11899905.662034,0,0,0,0,0,0
2,10377056.507734,0,0,0,0,0,0
3,7731257.992805,0,0,0,0,0,0
4,4725269.227067,0,30,0,0,0,30
5,2372791.046351,90,0,0,0,0,90

In [47]:
male_cleaning_data['total_cleaning_minutes'] = male_cleaning_data.Cleaning + \
                                               male_cleaning_data.Laundry + \
                                               male_cleaning_data.Sewing + \
                                               male_cleaning_data.Storing + \
                                               male_cleaning_data.Other

In [48]:
male_cleaning_data.head()

,weight,Cleaning,Laundry,Sewing,Storing,Other,total_cleaning_minutes
1,4447638.009513,25,0,0,0,0,25
6,5671341.270490,0,0,0,20,0,20
11,6755514.216327,40,10,0,0,0,50
12,13506297.294756,0,210,0,0,0,210
14,11791654.393174,0,0,0,0,0,0

In [50]:
male_cleaning_data['weighted_cleaning_minutes'] = male_cleaning_data.weight * male_cleaning_data.total_cleaning_minutes

In [51]:
male_cleaning_data.head()

,weight,Cleaning,Laundry,Sewing,Storing,Other,total_cleaning_minutes,weighted_cleaning_minutes
1,4447638.009513,25,0,0,0,0,25,1.111910e+08
6,5671341.270490,0,0,0,20,0,20,1.134268e+08
11,6755514.216327,40,10,0,0,0,50,3.377757e+08
12,13506297.294756,0,210,0,0,0,210,2.836322e+09
14,11791654.393174,0,0,0,0,0,0,0.000000e+00

In [54]:
male_cleaning_minutes = male_cleaning_data.weighted_cleaning_minutes.sum() / \
                        male_cleaning_data.weight.sum()

In [55]:
male_cleaning_minutes

15.102906392414331

In [57]:
female_cleaning_data['weighted_cleaning_minutes'] = female_cleaning_data.weight * \
                                                    female_cleaning_data.total_cleaning_minutes
female_cleaning_minutes = female_cleaning_data.weighted_cleaning_minutes.sum() / \
                        female_cleaning_data.weight.sum()

In [58]:
female_cleaning_minutes

52.473310443512105

In [59]:
males_cleaned = male_cleaning_data.total_cleaning_minutes > 0
females_cleaned = female_cleaning_data.total_cleaning_minutes > 0

In [68]:
males_cleaned_during_day = males_cleaned.value_counts()

In [71]:
males_cleaned_during_day = males_cleaned_during_day.to_frame()

In [72]:
females_cleaned_during_day = females_cleaned.value_counts()

In [73]:
females_cleaned_during_day = females_cleaned_during_day.to_frame()

In [74]:
percent_males_cleaned = males_cleaned_during_day.xs(True) /  (males_cleaned_during_day.xs(True) + \
                                                               males_cleaned_during_day.xs(False))

In [75]:
percent_males_cleaned

0    0.228847
dtype: float64

In [76]:
percent_females_cleaned = females_cleaned_during_day.xs(True) /  (females_cleaned_during_day.xs(True) + \
                                                               females_cleaned_during_day.xs(False))

In [77]:
percent_females_cleaned

0    0.509123
dtype: float64

In [28]:
summary2.columns

Index(['TUCASEID', 'TULINENO', 'TEAGE', 'TERRP', 'TESEX', 'TXAGE', 'TXRRP',
       'TXSEX'],
      dtype='object')

In [29]:
summary2.head()

         TUCASEID  TULINENO  TEAGE  TERRP  TESEX  TXAGE  TXRRP  TXSEX
0  20130101130004         1     22     18      2      0      0      0
1  20130101130004         2     50     24      1      0      0      0
2  20130101130004         3     48     24      2      0      0      0
3  20130101130004         4     20     25      2      0      0      0
4  20130101130004         5     15     25      1      0      0      0

In [30]:
summary3 = pd.read_csv("atusdata/atuscps_2013.dat")
summary3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 67855 entries, 0 to 67854
Columns: 375 entries, TUCASEID to PRDASIAN
dtypes: float64(2), int64(373)
memory usage: 194.7 MB

In [31]:
summary3.columns

Index(['TUCASEID', 'TULINENO', 'GEPSEUCL', 'GEPSEUST', 'GEREG', 'GESTCEN',
       'GESTFIPS', 'GTMETSTA', 'HEFAMINC', 'HEHOUSUT',
       ...
       'PXRET1', 'PXRRP', 'PXSCHENR', 'PXSCHFT', 'PXSCHLVL', 'PXSEX',
       'PXSPOUSE', 'QSTNUM', 'TRATUSR', 'PRDASIAN'],
      dtype='object', length=375)

In [32]:
states = summary3.GESTFIPS

In [33]:
states.head()

0    53
1    53
2    53
3    53
4    53
Name: GESTFIPS, dtype: int64

In [34]:
states.head(100)

0     53
1     53
2     53
3     53
4     53
5     53
6     53
7     26
8     12
9     12
10    48
11    48
12    48
13    36
14    36
15    29
16    12
17    12
18    26
19    42
20     6
21     6
22    13
23    13
24    13
25    37
26    32
27    32
28     5
29     5
      ..
70    11
71    39
72    29
73    46
74    46
75    13
76    13
77    42
78    42
79    42
80    42
81    42
82    42
83    42
84     8
85    36
86    36
87    36
88    42
89    36
90    36
91    27
92    27
93    17
94     1
95     1
96     6
97    18
98    18
99    18
Name: GESTFIPS, dtype: int64